# Task 1.2
# Пользователь вводит число. Вывести True если чётное, иначе - False.
#
x = int(input("Введите число: "))
b = x % 2 == 0
print(b)
